embtom/lib_serial/arch/stm32/src/lib_ser_STM32.c
/* ****************************************************************************************************
 * lib_ser.c within the following project: lib_ser
 *
 *  compiler:   GNU Tools ARM LINUX
 *  target:     armv6
 *  author:	    Tom
 * ****************************************************************************************************/

/* ****************************************************************************************************/

/*
 *	******************************* change log *******************************
 *  date			user			comment
 * 	23 Mai 2018		Tom			- creation of lib_ser.c
 *
 */

/* *******************************************************************
 * includes
 * ******************************************************************/

/* c-runtime */
#include <stdlib.h>
#include <string.h>

/* system */
#ifdef STM32HAL_F1
	#include <stm32f1xx.h>
	#include <stm32f1xx_hal_dma.h>		// Recursively required from tm32f1xx_hal_tim.h
	#include <stm32f1xx_hal_uart.h>		// RCC_* functions
	#include <stm32f1xx_hal_gpio.h>
	#include <stm32f4xx_hal_rcc.h>
	#include <stm32f1xx_hal_gpio_ex.h>
#elif STM32HAL_F4
	#include <stm32f4xx.h>
	#include <stm32f4xx_hal_dma.h>		// Recursively required from tm32f1xx_hal_tim.h
	#include <stm32f4xx_hal_uart.h>		// RCC_* functions
	#include <stm32f4xx_hal_gpio.h>
	#include <stm32f4xx_hal_rcc.h>
	#include <stm32f4xx_hal_gpio_ex.h>
#else
	#error No Architecture is set at lib_clock
#endif


/* frame */
#include <lib_convention__errno.h>
#include <lib_convention__macro.h>
#include <FreeRTOS.h>
#include <lib_log.h>
#include <lib_isr.h>
#include <lib_timer.h>

/* project */
#include "lib_ser_init_itf.h"
#include "lib_ser.h"

/* *******************************************************************
 * defines
 * ******************************************************************/
#define M_LIB_SER__MODULE_ID			"LIB_SER"
#define M_LIB_SER__HDL_INITIALIZED		0x7FAB7FAB
#define M_LIB_SER__WAIT_INFINITE		0xFFFF


#define M_SER_DMA_CHANNEL_MAP_DESCRIPTOR 															   \
{																									   \
	M_SER_DEVICE_CFG_UART_DMA(USART1, DMA2 ,Stream7, DMA_CHANNEL_4, Stream2,DMA_CHANNEL_4), \
	M_SER_DEVICE_CFG_UART_DMA(USART2, DMA1 ,Stream6, DMA_CHANNEL_4, Stream5,DMA_CHANNEL_4), \
	M_SER_DEVICE_CFG_UART_DMA(USART6, DMA2 ,Stream6, DMA_CHANNEL_5, Stream1,DMA_CHANNEL_5), \
}

//#define M_SER_DMA_CHANNEL_MAP_DESCRIPTOR 															   \
//{																									   \
//	M_SER_DEVICE_CFG_UART_DMA(USART1, DMA2 ,Stream7, DMA_CHANNEL_4, Stream2,DMA_CHANNEL_4), \
//	M_SER_DEVICE_CFG_UART_ISR(USART2), \
//	M_SER_DEVICE_CFG_UART_DMA(USART6, DMA2 ,Stream6, DMA_CHANNEL_5, Stream1,DMA_CHANNEL_5), \
//}




/* *******************************************************************
 * custom data types (e.g. enumerations, structures, unions)
 * ******************************************************************/
enum ser_mode {
	SER_MODE_isr,
	SER_MODE_dma
};

struct ser_hdl_attr
{
	/* HAL hdl */
	UART_HandleTypeDef huart;
	DMA_HandleTypeDef hdma_tx;
	DMA_HandleTypeDef hdma_rx;
	/* hdl */
	lib_isr_hdl_t isr_uart_hdl;
	lib_isr_hdl_t isr_dma_tx_hdl;
	lib_isr_hdl_t isr_dma_rx_hdl;
	timer_hdl_t rx_timeout_hdl;
	/* parameter */
	unsigned int rx_timeout_interval;
	ser_hdl_t *own_loc;
	enum ser_mode mode;
	IRQn_Type huart_isr_type;
	IRQn_Type hdma_tx_isr_type;
	IRQn_Type hdma_rx_isr_type;
	ser_tx_complete_handler_t *tx_complete_handler;
	ser_rx_complete_handler_t *rx_complete_handler;
	unsigned int initialized;
	struct rx_info rx_frame_info;
};


/* *******************************************************************
 * static data
 * ******************************************************************/
static struct ser_device_cfg __attribute__ ((section(".text"))) s_uart_dma_map[] = M_SER_DMA_CHANNEL_MAP_DESCRIPTOR;
static const char* __attribute__ ((section(".text"))) s_ser_mode_name[] = {"SER_MODE_isr", "SER_MODE_dma"};


/* *******************************************************************
 * static function declarations
 * ******************************************************************/
static void lib_ser__uart_event(IRQn_Type _isr_vector, unsigned int _vector, void *_arg);
static void lib_ser__uart_rx_timeout(timer_hdl_t _hdl, void* _arg);
static inline struct ser_device_cfg* lib_ser__get_dma_channel_map(USART_TypeDef *_uart);


/* *******************************************************************
 * function definition
 * ******************************************************************/

/* ************************************************************************//**
 * \brief  Initialization of the serial driver
 *
 * \param   _ser_hdl* [OUT]      : serial communication handle
 * \param   _baudrate            : serial baudrate
 * \param   _format              : serial port parameter setting
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__open(ser_hdl_t *_ser_hdl, void *_port, unsigned int _baudrate, enum data_format _format)
{
	int line, ret;
	struct ser_hdl_attr *ser_hdl;
	struct ser_device_cfg* device_cfg_desc;
	GPIO_InitTypeDef GPIO_InitStruct;

	if (_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	ser_hdl = (struct ser_hdl_attr*)pvPortMalloc(sizeof(struct ser_hdl_attr));
	if(ser_hdl == NULL) {
		line = __LINE__;
		ret = -ESTD_NOMEM;
		goto ERR_1;
	}

	switch (_format)
	{
		case DATA_FORMAT_8_NONE_2:
		{	/* 8 data bits, no   parity, 2 stop bit   */
			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_8B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_2;
			ser_hdl->huart.Init.Parity = UART_PARITY_NONE;
			break;
		}
		case DATA_FORMAT_8_EVEN_1:
		{	/* 8 data bits, even parity, 1 stop bit   */
			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_9B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_1;
			ser_hdl->huart.Init.Parity = UART_PARITY_EVEN;
			break;
		}
		case DATA_FORMAT_8_ODD_1:
		{	/* 8 data bits, odd  parity, 1 stop bit   */
			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_9B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_1;
			ser_hdl->huart.Init.Parity = UART_PARITY_ODD;
			break;
		}
		case DATA_FORMAT_8_NONE_1:
		{	/* 8 data bits, no   parity, 1 stop bit   */
			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_8B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_1;
			ser_hdl->huart.Init.Parity = UART_PARITY_NONE;
			break;
		}
		case DATA_FORMAT_7_EVEN_1:
		{	/* 7 data bits, even parity, 1 stop bit */
			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_8B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_1;
			ser_hdl->huart.Init.Parity = UART_PARITY_EVEN;
			break;
		}
		case DATA_FORMAT_7_ODD_1:
		{	/* 7 data bits, odd  parity, 1 stop bit */

			ser_hdl->huart.Init.WordLength = UART_WORDLENGTH_8B;
			ser_hdl->huart.Init.StopBits = UART_STOPBITS_1;
			ser_hdl->huart.Init.Parity = UART_PARITY_ODD;
			break;
		}
		default :
		{
			line = __LINE__;
			ret = -ESTD_INVAL;
			goto ERR_1;
		}
	}

	device_cfg_desc = lib_ser__get_dma_channel_map(_port);
	if (device_cfg_desc == NULL) {
		line = __LINE__;
		ret = -ESTD_NODEV;
		goto ERR_1;
	}

	ret = lib_isr__attach (&(ser_hdl->isr_uart_hdl), device_cfg_desc->huart_isr_type, &lib_ser__uart_event,  (void*)ser_hdl);
	if (ret < EOK) {
		line = __LINE__;
	 	goto ERR_1;
	}

	ret = lib_timer__open(&(ser_hdl->rx_timeout_hdl), ser_hdl, &lib_ser__uart_rx_timeout);
	if (ret < EOK) {
		line = __LINE__;
		goto ERR_2;
	}

	if ((device_cfg_desc->rx_dma_stream == NULL) || (device_cfg_desc->rx_dma_stream == NULL))
	{
		ser_hdl->huart_isr_type = device_cfg_desc->huart_isr_type;
		ser_hdl->isr_dma_tx_hdl = NULL;
		ser_hdl->isr_dma_rx_hdl = NULL;
		ser_hdl->mode = SER_MODE_isr;
 	}
 	else {

 		if(device_cfg_desc->dma == DMA1) {
 			__DMA1_CLK_ENABLE();
 		}
 		else if (device_cfg_desc->dma == DMA2) {
 			__DMA2_CLK_ENABLE();
 		}
 		else {
 			line = __LINE__;
 		 	ret = -ESTD_NODEV;
 		 	goto ERR_3;
 		}

