embtom/lib_serial/arch/stm32/src/lib_ser_STM32.c
 	    /* USART_TX DMA Init */
 		ser_hdl->hdma_tx.Instance = (DMA_Stream_TypeDef*)device_cfg_desc->tx_dma_stream; //DMA1_Stream6;
 	    ser_hdl->hdma_tx.Init.Channel = device_cfg_desc->tx_dma_channel; //DMA_CHANNEL_4;
 	    ser_hdl->hdma_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
 	    ser_hdl->hdma_tx.Init.PeriphInc = DMA_PINC_DISABLE;
 	    ser_hdl->hdma_tx.Init.MemInc = DMA_MINC_ENABLE;
 	    ser_hdl->hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
 	    ser_hdl->hdma_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
 	    ser_hdl->hdma_tx.Init.Mode = DMA_NORMAL;
 	    ser_hdl->hdma_tx.Init.Priority = DMA_PRIORITY_MEDIUM;
 	    ser_hdl->hdma_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
 	    ret = HAL_DMA_Init(&ser_hdl->hdma_tx);
 	    if (ret != HAL_OK) {
 	    	line = __LINE__;
 	   		ret = -EHAL_ERROR;
 	   		goto ERR_DMA_TX;
 	    }
 	   __HAL_LINKDMA(&(ser_hdl->huart),hdmatx,(ser_hdl->hdma_tx));

 	   /* USART_RX DMA Init */
 	   ser_hdl->hdma_rx.Instance = (DMA_Stream_TypeDef*)device_cfg_desc->rx_dma_stream;
 	   ser_hdl->hdma_rx.Init.Channel = device_cfg_desc->rx_dma_channel;
 	   ser_hdl->hdma_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
 	   ser_hdl->hdma_rx.Init.PeriphInc = DMA_PINC_DISABLE;
 	   ser_hdl->hdma_rx.Init.MemInc = DMA_MINC_ENABLE;
	   ser_hdl->hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	   ser_hdl->hdma_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
	   ser_hdl->hdma_rx.Init.Mode = DMA_NORMAL;
	   ser_hdl->hdma_rx.Init.Priority = DMA_PRIORITY_MEDIUM;
	   ser_hdl->hdma_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
	   ret = HAL_DMA_Init(&ser_hdl->hdma_rx);
	   if (ret != HAL_OK) {
		   line = __LINE__;
		   ret = -EHAL_ERROR;
		   goto ERR_DMA_RX;
	   }

	   __HAL_LINKDMA(&(ser_hdl->huart),hdmarx,(ser_hdl->hdma_rx));

	   ret = lib_isr__attach (&(ser_hdl->isr_dma_tx_hdl), device_cfg_desc->hdma_tx_isr_type, &lib_ser__uart_event,  (void*)ser_hdl);
	   if (ret < EOK) {
		   line = __LINE__;
		   goto ERR_DMA_ISR_TX;
	   }

	   ret = lib_isr__attach (&(ser_hdl->isr_dma_rx_hdl), device_cfg_desc->hdma_rx_isr_type, &lib_ser__uart_event,  (void*)ser_hdl);
	   if (ret < EOK) {
		   line = __LINE__;
		   goto ERR_DMA_ISR_RX;
	   }

	   ser_hdl->hdma_tx_isr_type = device_cfg_desc->hdma_tx_isr_type;
	   ser_hdl->hdma_rx_isr_type = device_cfg_desc->hdma_rx_isr_type;
	   ser_hdl->huart_isr_type = device_cfg_desc->huart_isr_type;
	   ser_hdl->mode = SER_MODE_dma;
 	}

	__HAL_RCC_USART2_CLK_ENABLE();

	ser_hdl->huart.Instance = _port;
	ser_hdl->huart.Init.BaudRate = _baudrate;
	ser_hdl->huart.Init.Mode = UART_MODE_TX_RX;
	ser_hdl->huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	ser_hdl->huart.Init.OverSampling = UART_OVERSAMPLING_16;
	ret = HAL_UART_Init(&(ser_hdl->huart));
	if (ret != HAL_OK) {
		line = __LINE__;
		ret = -EHAL_ERROR;
		if (ser_hdl->mode == SER_MODE_dma)
			goto ERR_DMA_UART_INIT;
		else
			goto ERR_2;
	}

	SET_BIT(ser_hdl->huart.Instance->CR1, USART_CR1_IDLEIE);


	ser_hdl->initialized = M_LIB_SER__HDL_INITIALIZED;
	ser_hdl->own_loc = _ser_hdl;
	*_ser_hdl = ser_hdl;
	msg (LOG_LEVEL_info, M_LIB_SER__MODULE_ID, "%s(): serial driver initialized at %s mode\n",__func__, s_ser_mode_name[ser_hdl->mode]);
    return EOK;

    ERR_DMA_UART_INIT:
	lib_isr__detach(&(ser_hdl->isr_dma_rx_hdl));

    ERR_DMA_ISR_RX:
	lib_isr__detach(&(ser_hdl->isr_dma_tx_hdl));

    ERR_DMA_ISR_TX:
	HAL_DMA_DeInit(&ser_hdl->hdma_rx);

    ERR_DMA_RX:
	HAL_DMA_DeInit(&ser_hdl->hdma_tx);

    ERR_DMA_TX:
	if(device_cfg_desc->dma == DMA1)
		__DMA1_CLK_DISABLE();
	else if (device_cfg_desc->dma == DMA2)
	 	__DMA2_CLK_DISABLE();

	ERR_3:
	lib_timer__close(&(ser_hdl->rx_timeout_hdl));

	ERR_2:
	__HAL_RCC_USART2_CLK_DISABLE();
	lib_isr__detach(&(ser_hdl->isr_uart_hdl));

    ERR_1:
	vPortFree(ser_hdl);

    ERR_0:
    msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)\n",__func__, ret, line );
    return ret;
}

/* ************************************************************************//**
 * \brief  Cleanup of the serial driver

 * \param   _ser_hdl* [OUT]      : serial communication handle
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__cleanup(ser_hdl_t *_ser_hdl)
{
	int line, ret;
	HAL_StatusTypeDef hal_ret;

	if (_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (*_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	if ((*_ser_hdl)->initialized != M_LIB_SER__HDL_INITIALIZED) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	if (((*_ser_hdl)->mode) == SER_MODE_dma) {

		ret = lib_isr__detach(&((*_ser_hdl)->isr_dma_rx_hdl));
		ret |= lib_isr__detach(&((*_ser_hdl)->isr_dma_tx_hdl));
		hal_ret = HAL_DMA_DeInit(&((*_ser_hdl)->hdma_rx));
		if (hal_ret != HAL_OK) {
			ret |= -EHAL_ERROR;
		}

		hal_ret = HAL_DMA_DeInit(&((*_ser_hdl)->hdma_tx));
		if (hal_ret != HAL_OK) {
			ret |= -EHAL_ERROR;
		}

		__DMA1_CLK_DISABLE();
		__DMA2_CLK_DISABLE();
	}

	ret |= lib_timer__close(&((*_ser_hdl)->rx_timeout_hdl));
	__HAL_RCC_USART2_CLK_DISABLE();
	lib_isr__detach(&((*_ser_hdl)->isr_uart_hdl));
	vPortFree(*_ser_hdl);
	*_ser_hdl = NULL;

    return EOK;

    ERR_0:
	msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)\n",__func__, ret, line );
	return ret;

}

/* ************************************************************************//**
 * \brief  Send of RAW data
 * \description	 A number of bytes (frame) is transmitted by the serial interface.
 * 	
 * \param   _ser_hdl [IN]        : serial communication handle
 * \param   _data_send[IN]       : a pointer to the data to be send
 * \param   _length         	 : number of bytes to send
 * \param   _tx_complete_handler : event handler, which signalizes if a serial frame is transmitted
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__send(ser_hdl_t _ser_hdl, uint8_t *_data_send, unsigned int _length, ser_tx_complete_handler_t _tx_complete_handler)
{
	HAL_StatusTypeDef hal_ret;
	int line, ret;

