embtom/lib_serial/arch/stm32/src/lib_ser_STM32.c
	if ((_ser_hdl == NULL) || (_data_send == NULL)) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (_ser_hdl->initialized != M_LIB_SER__HDL_INITIALIZED) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	_ser_hdl->tx_complete_handler = _tx_complete_handler;

	switch (_ser_hdl->mode) {

		case SER_MODE_isr:
			hal_ret = HAL_UART_Transmit_IT(&_ser_hdl->huart, _data_send, _length);
			break;
		case SER_MODE_dma:
			if (_length == 1) {
				hal_ret = HAL_UART_Transmit_IT(&_ser_hdl->huart, _data_send, _length);	
			}
			else {
				hal_ret = HAL_UART_Transmit_DMA(&_ser_hdl->huart, _data_send, _length);
			}

			break;
	}

	switch (hal_ret) {
		case HAL_OK     :	ret = EOK; break;
		case HAL_ERROR  :	ret = -EHAL_ERROR; break;
		case HAL_BUSY   :	ret = -ESTD_BUSY; break;
		case HAL_TIMEOUT:	ret = -EEXEC_TO; break;
		default: ret = -ESTD_FAULT; break;
	}

	if (ret < EOK) {
		line = __LINE__;
		goto ERR_0;
	}

    return EOK;

	ERR_0:
	msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)",__func__, ret, line );
	return ret;
}

/* ************************************************************************//**
 * \brief  Initialization an serial receiver to handle incoming data
 * \description	 This routine is responsible to configure a receiver path
 * 				 for incoming data. The registered event handler is called if a
 * 				 inter-frame timeout is occurred or the prepared receive buffer
 * 				 is overrun. 
 *
 * \param   _ser_hdl [IN]        : serial communication handle
 * \param   _receive_buffer[out] : a pointer to store the received data
 * \param   _length         	 : maximal length of the receive buffer
 * \param   _timeout			 : timeout (ms) for RX cancellation in case of no incoming data. timeout = 0 for disable
 * \param   _rx_complete_handler : event handler, that the maximal buffer length is
 * 								   reached or the adjusted inter-frame timeout eyceeded
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__prepare_receiver(ser_hdl_t _ser_hdl, uint8_t *_receive_buffer, unsigned int _length, unsigned int _timeout, ser_rx_complete_handler_t *_rx_complete_handler)
{
	int ret, line;
	HAL_StatusTypeDef hal_ret;

	if (_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (_timeout == 0) {
		line = __LINE__;
		ret = -ESTD_INVAL;
		goto ERR_0;
	}

	if ((_ser_hdl == NULL) || (_receive_buffer == NULL)) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (_ser_hdl->initialized != M_LIB_SER__HDL_INITIALIZED) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	CLEAR_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
	memset(&_ser_hdl->rx_frame_info, 0, sizeof(struct rx_info));
	_ser_hdl->rx_complete_handler = _rx_complete_handler;
	_ser_hdl->rx_timeout_interval = _timeout;
	HAL_UART_AbortReceive(&_ser_hdl->huart);

	switch (_ser_hdl->mode) {
		case SER_MODE_isr:
			hal_ret = HAL_UART_Receive_IT(&_ser_hdl->huart,_receive_buffer,_length);
			break;

		case SER_MODE_dma:
			hal_ret = HAL_UART_Receive_DMA(&_ser_hdl->huart,_receive_buffer,_length);
			break;

		default:
			ret = -ESTD_FAULT;
			break;
	}

	switch (hal_ret) {
		case HAL_OK     :	ret = EOK; break;
		case HAL_ERROR  :	ret = -EHAL_ERROR; break;
		case HAL_BUSY   :	ret = -ESTD_BUSY; break;
		case HAL_TIMEOUT:	ret = -EEXEC_TO; break;
		default: ret = -ESTD_FAULT; break;
	}

	if (ret < EOK) {
		line = __LINE__;
		goto ERR_0;
	}
	SET_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
    return EOK;

	ERR_0:
	msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)",__func__, ret, line );
	return ret;

}

/* ************************************************************************//**
 * \brief  Start/Stop of the serial receiver
 * \description	 This routine starts or stops the receiver. So a new received frame
 * 				 can be processed at first. 
 *
 * \param   _ser_hdl [IN]        : serial communication handle
 * \param   _mode                : sets the receiver on/off
 *
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__set_receiver_on_off(ser_hdl_t _ser_hdl, const enum receive_mode _mode)
{
	int ret, line;

	if (_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (_ser_hdl->initialized != M_LIB_SER__HDL_INITIALIZED) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	if (_ser_hdl->initialized != M_LIB_SER__HDL_INITIALIZED) {
		return -EEXEC_NOINIT;
	}

	switch(_mode)
	{
		case RECEIVE_MODE_disable:
			CLEAR_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
			break;
		case RECEIVE_MODE_enable:
			SET_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
			break;
		default: {
			line = __LINE__;
			ret = -ESTD_FAULT;
			goto ERR_0;
		}
	}
    return EOK;

	ERR_0:
	msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)",__func__, ret, line );
	return ret;
}

/* ************************************************************************//**
 * \brief  Configure the destination address of the next receiver frame
 * \description	 This routine reconfigure the destination address and length of
 * 				 the receiver buffer.
 *
 * \param   _ser_hdl [IN]        : serial communication handle
 * \param   _receive_buffer[out] : a pointer to store the next to data to receive
 * \param   _length         	 : maximal length of the new receive buffer
 *
 * \return	EOK if successful
 * ****************************************************************************/
int lib_ser__set_receiver_frame(ser_hdl_t _ser_hdl, uint8_t *_receive_buffer, unsigned int _length)
{
	int ret, line;
	HAL_StatusTypeDef hal_ret;

	if (_ser_hdl == NULL) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if ((_ser_hdl == NULL) || (_receive_buffer == NULL)) {
		line = __LINE__;
		ret = -EPAR_NULL;
		goto ERR_0;
	}

	if (_ser_hdl->initialized != M_LIB_SER__HDL_INITIALIZED) {
		line = __LINE__;
		ret = -EEXEC_NOINIT;
		goto ERR_0;
	}

	CLEAR_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
	memset(&_ser_hdl->rx_frame_info, 0, sizeof(struct rx_info));
	HAL_UART_AbortReceive(&_ser_hdl->huart);

	switch (_ser_hdl->mode) {
		case SER_MODE_isr:
			hal_ret = HAL_UART_Receive_IT(&_ser_hdl->huart,_receive_buffer,_length);
			break;

		case SER_MODE_dma:
			hal_ret = HAL_UART_Receive_DMA(&_ser_hdl->huart,_receive_buffer,_length);
			break;

		default:
			ret = -ESTD_FAULT;
			break;
	}

	switch (hal_ret) {
		case HAL_OK     :	ret = EOK; break;
		case HAL_ERROR  :	ret = -EHAL_ERROR; break;
		case HAL_BUSY   :	ret = -ESTD_BUSY; break;
		case HAL_TIMEOUT:	ret = -EEXEC_TO; break;
		default: ret = -ESTD_FAULT; break;
	}

	if (ret < EOK) {
		line = __LINE__;
		goto ERR_0;
	}

	SET_BITVAL(_ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
	return EOK;

	ERR_0:
	msg (LOG_LEVEL_error, M_LIB_SER__MODULE_ID, "%s(): failed with retval %i (line %u)",__func__, ret, line );
	return ret;
}


/* *******************************************************************
 * static function definitions
 * ******************************************************************/

static void lib_ser__uart_event(IRQn_Type _isr_vector, unsigned int _vector, void *_arg)
{
	int ret;
	unsigned int remaining_bytes;
	enum lib_ser_isr_type isr_type;
	struct ser_hdl_attr *ser_hdl = (struct ser_hdl_attr *)_arg;
	if (_vector >= LIB_SER_ISR_TYPE_CNT) {
		return;
	}

