embtom/lib_serial/arch/stm32/src/lib_ser_STM32.c
	isr_type = (enum lib_ser_isr_type)_vector;
	switch (isr_type)
	{
		case LIB_SER_ISR_TYPE_uart:

			if(__HAL_UART_GET_FLAG((&(ser_hdl->huart)), UART_FLAG_IDLE)) {
				volatile uint32_t tmp;
				tmp = ser_hdl->huart.Instance->DR;
				lib_timer__stop((ser_hdl->rx_timeout_hdl));
				switch (ser_hdl->mode)
				{
					case SER_MODE_isr:
						ser_hdl->rx_frame_info.number_received_data++;
						break;

					case SER_MODE_dma:
						ser_hdl->rx_frame_info.number_received_data = ser_hdl->huart.RxXferSize - ser_hdl->hdma_rx.Instance->NDTR;
						break;
				}

				remaining_bytes = ser_hdl->huart.RxXferSize - ser_hdl->hdma_rx.Instance->NDTR;
				__HAL_UART_CLEAR_FLAG((&(ser_hdl->huart)),UART_FLAG_IDLE);
				lib_timer__start((ser_hdl->rx_timeout_hdl),ser_hdl->rx_timeout_interval);
			//	__HAL_DMA_DISABLE(&(ser_hdl->hdma_rx));
			}
			else {
				HAL_UART_IRQHandler(&(ser_hdl->huart));
			}
			break;
		case LIB_SER_ISR_TYPE_dma_tx:
			HAL_DMA_IRQHandler(&(ser_hdl->hdma_tx));
			break;
		case LIB_SER_ISR_TYPE_dma_rx:
			HAL_DMA_IRQHandler(&(ser_hdl->hdma_rx));
			break;
	}

}

static void lib_ser__uart_rx_timeout(timer_hdl_t _hdl, void* _arg)
{
	enum receive_mode receive_mode_ret;
	struct ser_hdl_attr *ser_hdl = (struct ser_hdl_attr *)_arg;

	if (ser_hdl->rx_complete_handler != NULL) {
		receive_mode_ret = (*ser_hdl->rx_complete_handler)(ser_hdl->own_loc, RECEIVE_EVENT_timeout, &ser_hdl->rx_frame_info);
	}
	else {
		receive_mode_ret = RECEIVE_MODE_enable;
	}

//	memset(&ser_hdl->rx_frame_info,0,sizeof(struct rx_info));

	switch (receive_mode_ret)
	{
		case RECEIVE_MODE_disable:
			CLEAR_BITVAL(ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
			break;
		case RECEIVE_MODE_enable:
		default:
			break;
	}


}


void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	struct ser_hdl_attr *ser_hdl = (struct ser_hdl_attr *)GET_CONTAINER_OF(huart,struct ser_hdl_attr,huart);
	if (ser_hdl->tx_complete_handler != NULL) {
		(*ser_hdl->tx_complete_handler)(ser_hdl->own_loc);
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	enum receive_mode receive_mode_ret;
	struct ser_hdl_attr *ser_hdl = (struct ser_hdl_attr *)GET_CONTAINER_OF(huart,struct ser_hdl_attr,huart);

	if (ser_hdl->rx_complete_handler != NULL) {
		receive_mode_ret = (*ser_hdl->rx_complete_handler)(ser_hdl->own_loc, RECEIVE_EVENT_overflow, &ser_hdl->rx_frame_info);
	}
	else {
		receive_mode_ret = RECEIVE_MODE_enable;
	}

	//memset(&ser_hdl->rx_frame_info,0,sizeof(struct rx_info));

	switch (receive_mode_ret)
	{
		case RECEIVE_MODE_disable:
			CLEAR_BITVAL(ser_hdl->huart.Instance->CR1,USART_CR1_RE_Pos);
			return;
		case RECEIVE_MODE_enable:
			HAL_UART_Receive_DMA(&ser_hdl->huart, ser_hdl->huart.pRxBuffPtr, ser_hdl->huart.RxXferSize);
			break;
	}

}


static inline struct ser_device_cfg* lib_ser__get_dma_channel_map(USART_TypeDef *_uart)
{
	int iter;
	for(iter =0; iter < sizeof(s_uart_dma_map)/sizeof(*s_uart_dma_map); iter++) {
		if (s_uart_dma_map[iter].uart_device == _uart) {
			return &s_uart_dma_map[iter];
		}
	}
	return NULL;
}

